load/reports/certified-target/spike.stdout.txt

         /\      Grafana   /‾‾/
    /\  /  \     |\  __   /  /
   /  \/    \    | |/ /  /   ‾‾\
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/

     execution: local
        script: /load/k6/capacity.js
        output: -

     scenarios: (100.00%) 1 scenario, 500 max VUs, 1m30s max duration (incl. graceful stop):
              * spike: 33.00 iterations/s for 1m0s (maxVUs: 150-500, gracefulStop: 30s)


running (0m01.0s), 008/150 VUs, 25 complete and 0 interrupted iterations
spike   [   2% ] 008/150 VUs  0m01.0s/1m0s  33.00 iters/s
time="2026-08-14T12:33:46Z" level=info msg="{\"sample\":true,\"scenario\":\"spike\",\"instance\":\"http://payment-api-1:8080\",\"status\":200,\"requestId\":\"c451fe74-ea48-406b-9306-6ff239a36934\",\"idempotencyKey\":\"03614f7b-1009-4cb6-91ce-000a3b211ff6\"}" source=console

running (0m02.0s), 012/150 VUs, 54 complete and 0 interrupted iterations
spike   [   3% ] 012/150 VUs  0m02.0s/1m0s  33.00 iters/s

running (0m03.0s), 011/150 VUs, 88 complete and 0 interrupted iterations
spike   [   5% ] 011/150 VUs  0m03.0s/1m0s  33.00 iters/s
time="2026-08-14T12:33:47Z" level=info msg="{\"sample\":true,\"scenario\":\"spike\",\"instance\":\"http://payment-api-1:8080\",\"status\":200,\"requestId\":\"70ab3907-ad5a-4c51-ac6c-bcdd307bceb2\",\"idempotencyKey\":\"eb032527-5d46-49ab-a694-b9c295f7fbe9\"}" source=console

running (0m04.0s), 008/150 VUs, 124 complete and 0 interrupted iterations
spike   [   7% ] 008/150 VUs  0m04.0s/1m0s  33.00 iters/s
time="2026-08-14T12:33:49Z" level=info msg="{\"sample\":true,\"scenario\":\"spike\",\"instance\":\"http://payment-api-1:8080\",\"status\":200,\"requestId\":\"75906282-b48f-4f26-9c3a-65ff445e1c49\",\"idempotencyKey\":\"96c635e1-d2e6-42bb-bbe0-8f227953ac31\"}" source=console

running (0m05.0s), 005/150 VUs, 160 complete and 0 interrupted iterations
spike   [   8% ] 005/150 VUs  0m05.0s/1m0s  33.00 iters/s

running (0m06.0s), 013/150 VUs, 185 complete and 0 interrupted iterations
spike   [  10% ] 013/150 VUs  0m06.0s/1m0s  33.00 iters/s
time="2026-08-14T12:33:50Z" level=info msg="{\"sample\":true,\"scenario\":\"spike\",\"instance\":\"http://payment-api-1:8080\",\"status\":429,\"requestId\":null,\"idempotencyKey\":\"aca245e1-c2e5-4e60-8bdf-0fd39759f0fe\"}" source=console

running (0m07.0s), 011/150 VUs, 220 complete and 0 interrupted iterations
spike   [  12% ] 011/150 VUs  0m07.0s/1m0s  33.00 iters/s
time="2026-08-14T12:33:52Z" level=info msg="{\"sample\":true,\"scenario\":\"spike\",\"instance\":\"http://payment-api-1:8080\",\"status\":200,\"requestId\":\"06ecf960-ff45-47fe-ad20-454b2a3befb9\",\"idempotencyKey\":\"eaf741f4-a88e-40ff-b28c-96462c7a2c59\"}" source=console

running (0m08.0s), 007/150 VUs, 257 complete and 0 interrupted iterations
spike   [  13% ] 007/150 VUs  0m08.0s/1m0s  33.00 iters/s

running (0m09.0s), 007/150 VUs, 290 complete and 0 interrupted iterations
spike   [  15% ] 007/150 VUs  0m09.0s/1m0s  33.00 iters/s
time="2026-08-14T12:33:54Z" level=info msg="{\"sample\":true,\"scenario\":\"spike\",\"instance\":\"http://payment-api-1:8080\",\"status\":200,\"requestId\":\"e901717e-a338-45e7-9ee5-3d2798269ecd\",\"idempotencyKey\":\"764b8344-19e6-4fd7-8537-2459c7c43bac\"}" source=console

running (0m10.0s), 011/150 VUs, 319 complete and 0 interrupted iterations
spike   [  17% ] 011/150 VUs  0m10.0s/1m0s  33.00 iters/s

running (0m11.0s), 011/150 VUs, 352 complete and 0 interrupted iterations
spike   [  18% ] 011/150 VUs  0m11.0s/1m0s  33.00 iters/s
time="2026-08-14T12:33:55Z" level=info msg="{\"sample\":true,\"scenario\":\"spike\",\"instance\":\"http://payment-api-1:8080\",\"status\":200,\"requestId\":\"75bb62e0-8c69-4669-840c-fabcf72a35c0\",\"idempotencyKey\":\"972af9d5-0ddf-4f70-9e94-b33fe75fb492\"}" source=console

running (0m12.0s), 009/150 VUs, 387 complete and 0 interrupted iterations
spike   [  20% ] 009/150 VUs  0m12.0s/1m0s  33.00 iters/s
time="2026-08-14T12:33:56Z" level=info msg="{\"sample\":true,\"scenario\":\"spike\",\"instance\":\"http://payment-api-1:8080\",\"status\":429,\"requestId\":null,\"idempotencyKey\":\"e4e630cf-b746-46e9-8010-97668ee4350d\"}" source=console

running (0m13.0s), 006/150 VUs, 423 complete and 0 interrupted iterations
spike   [  22% ] 006/150 VUs  0m13.0s/1m0s  33.00 iters/s
time="2026-08-14T12:33:57Z" level=info msg="{\"sample\":true,\"scenario\":\"spike\",\"instance\":\"http://payment-api-1:8080\",\"status\":429,\"requestId\":null,\"idempotencyKey\":\"49e97403-1074-42cd-860a-798ffc62e98d\"}" source=console

running (0m14.0s), 012/150 VUs, 450 complete and 0 interrupted iterations
spike   [  23% ] 012/150 VUs  0m14.0s/1m0s  33.00 iters/s

running (0m15.0s), 010/150 VUs, 485 complete and 0 interrupted iterations
spike   [  25% ] 010/150 VUs  0m15.0s/1m0s  33.00 iters/s
time="2026-08-14T12:34:00Z" level=info msg="{\"sample\":true,\"scenario\":\"spike\",\"instance\":\"http://payment-api-1:8080\",\"status\":200,\"requestId\":\"d591a0a0-55d6-4536-9733-fea20a3dea1c\",\"idempotencyKey\":\"757d298a-be4d-4c96-bc30-8d12c5142990\"}" source=console

running (0m16.0s), 008/150 VUs, 520 complete and 0 interrupted iterations
spike   [  27% ] 008/150 VUs  0m16.0s/1m0s  33.00 iters/s

running (0m17.0s), 007/150 VUs, 554 complete and 0 interrupted iterations
spike   [  28% ] 007/150 VUs  0m17.0s/1m0s  33.00 iters/s
time="2026-08-14T12:34:01Z" level=info msg="{\"sample\":true,\"scenario\":\"spike\",\"instance\":\"http://payment-api-1:8080\",\"status\":429,\"requestId\":null,\"idempotencyKey\":\"265d5495-04ff-4d25-bdc3-fcbadb1e5787\"}" source=console

running (0m18.0s), 011/150 VUs, 583 complete and 0 interrupted iterations
spike   [  30% ] 011/150 VUs  0m18.0s/1m0s  33.00 iters/s
time="2026-08-14T12:34:02Z" level=info msg="{\"sample\":true,\"scenario\":\"spike\",\"instance\":\"http://payment-api-1:8080\",\"status\":200,\"requestId\":\"853cfeea-a631-4e72-b762-3ab8fd672d9b\",\"idempotencyKey\":\"fd4d9005-39cf-4759-95aa-79b37bc98186\"}" source=console

running (0m19.0s), 009/150 VUs, 618 complete and 0 interrupted iterations
spike   [  32% ] 009/150 VUs  0m19.0s/1m0s  33.00 iters/s
time="2026-08-14T12:34:03Z" level=info msg="{\"sample\":true,\"scenario\":\"spike\",\"instance\":\"http://payment-api-1:8080\",\"status\":429,\"requestId\":null,\"idempotencyKey\":\"c98b25e8-2e6e-4371-b47c-3be00f462b5b\"}" source=console

running (0m20.0s), 007/150 VUs, 653 complete and 0 interrupted iterations
spike   [  33% ] 007/150 VUs  0m20.0s/1m0s  33.00 iters/s

running (0m21.0s), 012/150 VUs, 681 complete and 0 interrupted iterations
spike   [  35% ] 012/150 VUs  0m21.0s/1m0s  33.00 iters/s
time="2026-08-14T12:34:05Z" level=info msg="{\"sample\":true,\"scenario\":\"spike\",\"instance\":\"http://payment-api-1:8080\",\"status\":200,\"requestId\":\"5b2b4515-f3a0-4190-88a2-52f797be4a54\",\"idempotencyKey\":\"70c915f7-dc89-4dc8-9002-1df9623dbfbf\"}" source=console

running (0m22.0s), 011/150 VUs, 715 complete and 0 interrupted iterations
spike   [  37% ] 011/150 VUs  0m22.0s/1m0s  33.00 iters/s
time="2026-08-14T12:34:07Z" level=info msg="{\"sample\":true,\"scenario\":\"spike\",\"instance\":\"http://payment-api-1:8080\",\"status\":200,\"requestId\":\"9bd19f3c-a77e-4658-92dc-d562f3b1426c\",\"idempotencyKey\":\"c611cd88-1aa9-42b4-9e7f-f7ec3ff044fe\"}" source=console

running (0m23.0s), 008/150 VUs, 751 complete and 0 interrupted iterations
spike   [  38% ] 008/150 VUs  0m23.0s/1m0s  33.00 iters/s

running (0m24.0s), 007/150 VUs, 785 complete and 0 interrupted iterations
spike   [  40% ] 007/150 VUs  0m24.0s/1m0s  33.00 iters/s
time="2026-08-14T12:34:08Z" level=info msg="{\"sample\":true,\"scenario\":\"spike\",\"instance\":\"http://payment-api-1:8080\",\"status\":429,\"requestId\":null,\"idempotencyKey\":\"e65609a6-7a0f-41af-83a7-b896e75598e4\"}" source=console

running (0m25.0s), 013/150 VUs, 812 complete and 0 interrupted iterations
spike   [  42% ] 013/150 VUs  0m25.0s/1m0s  33.00 iters/s
time="2026-08-14T12:34:10Z" level=info msg="{\"sample\":true,\"scenario\":\"spike\",\"instance\":\"http://payment-api-1:8080\",\"status\":422,\"requestId\":\"2622c89d-80e3-4677-ba66-bf3ef50502bd\",\"idempotencyKey\":\"6fa9b1a6-9c79-4544-8cd1-ed29af56aeee\"}" source=console

running (0m26.0s), 011/150 VUs, 847 complete and 0 interrupted iterations
spike   [  43% ] 011/150 VUs  0m26.0s/1m0s  33.00 iters/s
time="2026-08-14T12:34:11Z" level=info msg="{\"sample\":true,\"scenario\":\"spike\",\"instance\":\"http://payment-api-1:8080\",\"status\":200,\"requestId\":\"6dbfa43f-f999-4363-9fd3-f80aa8695483\",\"idempotencyKey\":\"badbf9eb-b8bc-4a6f-abbb-89630c52d6cf\"}" source=console

running (0m27.0s), 008/150 VUs, 883 complete and 0 interrupted iterations
spike   [  45% ] 008/150 VUs  0m27.0s/1m0s  33.00 iters/s

running (0m28.0s), 007/150 VUs, 917 complete and 0 interrupted iterations
spike   [  47% ] 007/150 VUs  0m28.0s/1m0s  33.00 iters/s
time="2026-08-14T12:34:13Z" level=info msg="{\"sample\":true,\"scenario\":\"spike\",\"instance\":\"http://payment-api-1:8080\",\"status\":200,\"requestId\":\"43183250-05cb-4f2e-9170-884dbde56996\",\"idempotencyKey\":\"de4da41c-547c-4d29-bdb7-7ff4059990ff\"}" source=console

running (0m29.0s), 013/150 VUs, 944 complete and 0 interrupted iterations
spike   [  48% ] 013/150 VUs  0m29.0s/1m0s  33.00 iters/s

running (0m30.0s), 011/150 VUs, 979 complete and 0 interrupted iterations
spike   [  50% ] 011/150 VUs  0m30.0s/1m0s  33.00 iters/s
time="2026-08-14T12:34:15Z" level=info msg="{\"sample\":true,\"scenario\":\"spike\",\"instance\":\"http://payment-api-1:8080\",\"status\":200,\"requestId\":\"c7ed018e-2394-416f-a1a8-d63ca06ec7b4\",\"idempotencyKey\":\"0ef38a23-6834-416c-9c47-c2624e5b8448\"}" source=console

running (0m31.0s), 008/150 VUs, 1015 complete and 0 interrupted iterations
spike   [  52% ] 008/150 VUs  0m31.0s/1m0s  33.00 iters/s
time="2026-08-14T12:34:15Z" level=info msg="{\"sample\":true,\"scenario\":\"spike\",\"instance\":\"http://payment-api-1:8080\",\"status\":429,\"requestId\":null,\"idempotencyKey\":\"5f2f540a-fc3f-4a41-a538-4af8a0f53e1f\"}" source=console

running (0m32.0s), 006/150 VUs, 1050 complete and 0 interrupted iterations
spike   [  53% ] 006/150 VUs  0m32.0s/1m0s  33.00 iters/s

running (0m33.0s), 012/150 VUs, 1077 complete and 0 interrupted iterations
spike   [  55% ] 012/150 VUs  0m33.0s/1m0s  33.00 iters/s

running (0m34.0s), 010/150 VUs, 1112 complete and 0 interrupted iterations
spike   [  57% ] 010/150 VUs  0m34.0s/1m0s  33.00 iters/s
time="2026-08-14T12:34:18Z" level=info msg="{\"sample\":true,\"scenario\":\"spike\",\"instance\":\"http://payment-api-1:8080\",\"status\":200,\"requestId\":\"b5cf3cc6-9528-4a70-835b-19776e9af1fb\",\"idempotencyKey\":\"703dab60-bda8-4937-a7a4-7d7d1d1733d2\"}" source=console

running (0m35.0s), 008/150 VUs, 1147 complete and 0 interrupted iterations
spike   [  58% ] 008/150 VUs  0m35.0s/1m0s  33.00 iters/s
time="2026-08-14T12:34:19Z" level=info msg="{\"sample\":true,\"scenario\":\"spike\",\"instance\":\"http://payment-api-1:8080\",\"status\":200,\"requestId\":\"50da0ab7-1493-47ed-8460-67d0661286a2\",\"idempotencyKey\":\"7b32858a-c374-47d7-9907-2850637c2078\"}" source=console
time="2026-08-14T12:34:20Z" level=info msg="{\"sample\":true,\"scenario\":\"spike\",\"instance\":\"http://payment-api-1:8080\",\"status\":200,\"requestId\":\"5e0e428d-3b14-4adb-a75f-75151093a94f\",\"idempotencyKey\":\"9171ee96-1784-461f-8d3f-3d7053db0ba3\"}" source=console

running (0m36.0s), 010/150 VUs, 1178 complete and 0 interrupted iterations
spike   [  60% ] 010/150 VUs  0m36.0s/1m0s  33.00 iters/s

running (0m37.0s), 011/150 VUs, 1210 complete and 0 interrupted iterations
spike   [  62% ] 011/150 VUs  0m37.0s/1m0s  33.00 iters/s
time="2026-08-14T12:34:21Z" level=info msg="{\"sample\":true,\"scenario\":\"spike\",\"instance\":\"http://payment-api-1:8080\",\"status\":429,\"requestId\":null,\"idempotencyKey\":\"565394c6-c1ae-4576-998d-d2e7a24a9a62\"}" source=console

running (0m38.0s), 010/150 VUs, 1244 complete and 0 interrupted iterations
spike   [  63% ] 010/150 VUs  0m38.0s/1m0s  33.00 iters/s

running (0m39.0s), 007/150 VUs, 1280 complete and 0 interrupted iterations
spike   [  65% ] 007/150 VUs  0m39.0s/1m0s  33.00 iters/s
time="2026-08-14T12:34:23Z" level=info msg="{\"sample\":true,\"scenario\":\"spike\",\"instance\":\"http://payment-api-1:8080\",\"status\":200,\"requestId\":\"7ca06d11-83ae-417c-b078-b283be050f54\",\"idempotencyKey\":\"5ccabcb7-244d-4e0b-9de7-5c10d9e32d25\"}" source=console

running (0m40.0s), 013/150 VUs, 1307 complete and 0 interrupted iterations
spike   [  67% ] 013/150 VUs  0m40.0s/1m0s  33.00 iters/s
time="2026-08-14T12:34:25Z" level=info msg="{\"sample\":true,\"scenario\":\"spike\",\"instance\":\"http://payment-api-1:8080\",\"status\":200,\"requestId\":\"81983286-cc3d-4f65-8627-33d4c1468e45\",\"idempotencyKey\":\"06fd2d77-c184-4a4d-bb81-b23382c4a520\"}" source=console

running (0m41.0s), 010/150 VUs, 1343 complete and 0 interrupted iterations
spike   [  68% ] 010/150 VUs  0m41.0s/1m0s  33.00 iters/s

running (0m42.0s), 008/150 VUs, 1378 complete and 0 interrupted iterations
spike   [  70% ] 008/150 VUs  0m42.0s/1m0s  33.00 iters/s
time="2026-08-14T12:34:26Z" level=info msg="{\"sample\":true,\"scenario\":\"spike\",\"instance\":\"http://payment-api-1:8080\",\"status\":429,\"requestId\":null,\"idempotencyKey\":\"c9328470-b671-4e1f-8e0c-d9badf30d042\"}" source=console

running (0m43.0s), 007/150 VUs, 1412 complete and 0 interrupted iterations
spike   [  72% ] 007/150 VUs  0m43.0s/1m0s  33.00 iters/s
time="2026-08-14T12:34:27Z" level=info msg="{\"sample\":true,\"scenario\":\"spike\",\"instance\":\"http://payment-api-1:8080\",\"status\":429,\"requestId\":null,\"idempotencyKey\":\"d320152a-11cd-4bbe-be11-8a7d8ce81816\"}" source=console

running (0m44.0s), 012/150 VUs, 1440 complete and 0 interrupted iterations
spike   [  73% ] 012/150 VUs  0m44.0s/1m0s  33.00 iters/s

running (0m45.0s), 010/150 VUs, 1475 complete and 0 interrupted iterations
spike   [  75% ] 010/150 VUs  0m45.0s/1m0s  33.00 iters/s
time="2026-08-14T12:34:30Z" level=info msg="{\"sample\":true,\"scenario\":\"spike\",\"instance\":\"http://payment-api-1:8080\",\"status\":200,\"requestId\":\"bebbf077-f520-48dc-bbab-e10144e6d9c1\",\"idempotencyKey\":\"77dc7120-9b76-47ad-a9cf-dc3ac1b00ba0\"}" source=console

running (0m46.0s), 008/150 VUs, 1510 complete and 0 interrupted iterations
spike   [  77% ] 008/150 VUs  0m46.0s/1m0s  33.00 iters/s
time="2026-08-14T12:34:30Z" level=info msg="{\"sample\":true,\"scenario\":\"spike\",\"instance\":\"http://payment-api-1:8080\",\"status\":200,\"requestId\":\"07701950-4a79-4d8a-96f0-babaa97f0d0f\",\"idempotencyKey\":\"c65507f0-1cd3-4cc4-ba49-520e628e6106\"}" source=console

running (0m47.0s), 013/150 VUs, 1538 complete and 0 interrupted iterations
spike   [  78% ] 013/150 VUs  0m47.0s/1m0s  33.00 iters/s

running (0m48.0s), 011/150 VUs, 1573 complete and 0 interrupted iterations
spike   [  80% ] 011/150 VUs  0m48.0s/1m0s  33.00 iters/s
time="2026-08-14T12:34:32Z" level=info msg="{\"sample\":true,\"scenario\":\"spike\",\"instance\":\"http://payment-api-1:8080\",\"status\":429,\"requestId\":null,\"idempotencyKey\":\"3b8f02de-ab55-4f75-8355-9e0bb06b2713\"}" source=console

running (0m49.0s), 009/150 VUs, 1608 complete and 0 interrupted iterations
spike   [  82% ] 009/150 VUs  0m49.0s/1m0s  33.00 iters/s
time="2026-08-14T12:34:34Z" level=info msg="{\"sample\":true,\"scenario\":\"spike\",\"instance\":\"http://payment-api-1:8080\",\"status\":200,\"requestId\":\"9e6b849f-f3f7-4e3c-aeae-dc34419c4683\",\"idempotencyKey\":\"965fac5d-5776-43a4-9c5d-d191d585cc46\"}" source=console

running (0m50.0s), 006/150 VUs, 1644 complete and 0 interrupted iterations
spike   [  83% ] 006/150 VUs  0m50.0s/1m0s  33.00 iters/s

running (0m51.0s), 013/150 VUs, 1670 complete and 0 interrupted iterations
spike   [  85% ] 013/150 VUs  0m51.0s/1m0s  33.00 iters/s
time="2026-08-14T12:34:35Z" level=info msg="{\"sample\":true,\"scenario\":\"spike\",\"instance\":\"http://payment-api-1:8080\",\"status\":429,\"requestId\":null,\"idempotencyKey\":\"33bec13a-0d7b-434e-b73e-6b266e3160a7\"}" source=console

running (0m52.0s), 010/150 VUs, 1706 complete and 0 interrupted iterations
spike   [  87% ] 010/150 VUs  0m52.0s/1m0s  33.00 iters/s
time="2026-08-14T12:34:37Z" level=info msg="{\"sample\":true,\"scenario\":\"spike\",\"instance\":\"http://payment-api-1:8080\",\"status\":200,\"requestId\":\"fdc5a6ec-df77-41ea-9f98-294b46922b80\",\"idempotencyKey\":\"ec8216ae-2c3d-4bc3-b835-7b4da844e379\"}" source=console

running (0m53.0s), 009/150 VUs, 1740 complete and 0 interrupted iterations
spike   [  88% ] 009/150 VUs  0m53.0s/1m0s  33.00 iters/s
time="2026-08-14T12:34:38Z" level=info msg="{\"sample\":true,\"scenario\":\"spike\",\"instance\":\"http://payment-api-1:8080\",\"status\":200,\"requestId\":\"5e22bc14-633f-4a15-8fed-d545c1604bd8\",\"idempotencyKey\":\"550b9618-c9a1-4d29-8295-0156efff7ccf\"}" source=console

running (0m54.0s), 005/150 VUs, 1777 complete and 0 interrupted iterations
spike   [  90% ] 005/150 VUs  0m54.0s/1m0s  33.00 iters/s

running (0m55.0s), 013/150 VUs, 1802 complete and 0 interrupted iterations
spike   [  92% ] 013/150 VUs  0m55.0s/1m0s  33.00 iters/s

running (0m56.0s), 010/150 VUs, 1838 complete and 0 interrupted iterations
spike   [  93% ] 010/150 VUs  0m56.0s/1m0s  33.00 iters/s
time="2026-08-14T12:34:41Z" level=info msg="{\"sample\":true,\"scenario\":\"spike\",\"instance\":\"http://payment-api-1:8080\",\"status\":200,\"requestId\":\"3be5b3e7-5d9a-48bb-a254-12b3daaa0dde\",\"idempotencyKey\":\"8a846af9-10e7-4107-a2ce-eced2ddfcca5\"}" source=console

running (0m57.0s), 007/150 VUs, 1874 complete and 0 interrupted iterations
spike   [  95% ] 007/150 VUs  0m57.0s/1m0s  33.00 iters/s
time="2026-08-14T12:34:41Z" level=info msg="{\"sample\":true,\"scenario\":\"spike\",\"instance\":\"http://payment-api-1:8080\",\"status\":429,\"requestId\":null,\"idempotencyKey\":\"08c3b8d4-5ef0-4413-8df8-da71fcd54fab\"}" source=console

running (0m58.0s), 012/150 VUs, 1902 complete and 0 interrupted iterations
spike   [  97% ] 012/150 VUs  0m58.0s/1m0s  33.00 iters/s
time="2026-08-14T12:34:42Z" level=info msg="{\"sample\":true,\"scenario\":\"spike\",\"instance\":\"http://payment-api-1:8080\",\"status\":200,\"requestId\":\"338ef0c7-eef2-4613-844e-3b0757eebe8e\",\"idempotencyKey\":\"84676f35-f3ea-45e5-b706-f338145c1439\"}" source=console

running (0m59.0s), 003/150 VUs, 1944 complete and 0 interrupted iterations
spike   [  98% ] 003/150 VUs  0m59.0s/1m0s  33.00 iters/s

running (1m00.0s), 006/150 VUs, 1974 complete and 0 interrupted iterations
spike   [ 100% ] 006/150 VUs  1m00.0s/1m0s  33.00 iters/s

     cap_key_0_reqs.................: 991    16.470083/s
     cap_key_1_reqs.................: 990    16.453463/s
     cap_status_200.................: 1111   18.464442/s
     cap_status_422.................: 101    1.678586/s
     cap_status_429.................: 769    12.780518/s
     data_received..................: 764 kB 13 kB/s
     data_sent......................: 800 kB 13 kB/s
     http_req_blocked...............: avg=51.71µs  min=1.66µs   med=4.5µs    max=10.85ms  p(90)=160.5µs  p(95)=211.83µs p(99)=418.83µs
     http_req_connecting............: avg=38.48µs  min=0s       med=0s       max=10.81ms  p(90)=121.37µs p(95)=161.75µs p(99)=318.16µs
   ✓ http_req_duration..............: avg=182.55ms min=245.29µs med=228.04ms max=464.26ms p(90)=379.14ms p(95)=399.77ms p(99)=416.72ms
       { expected_response:true }...: avg=182.55ms min=245.29µs med=228.04ms max=464.26ms p(90)=379.14ms p(95)=399.77ms p(99)=416.72ms
     http_req_failed................: 0.00%  0 out of 1981
     http_req_receiving.............: avg=42.28µs  min=6.5µs    med=34.54µs  max=259.16µs p(90)=78.75µs  p(95)=95.29µs  p(99)=131.54µs
     http_req_sending...............: avg=25.74µs  min=5.79µs   med=17.62µs  max=235.12µs p(90)=51.12µs  p(95)=64.54µs  p(99)=101.12µs
     http_req_tls_handshaking.......: avg=0s       min=0s       med=0s       max=0s       p(90)=0s       p(95)=0s       p(99)=0s
     http_req_waiting...............: avg=182.48ms min=229.29µs med=227.98ms max=464.17ms p(90)=379.09ms p(95)=399.7ms  p(99)=416.63ms
     http_reqs......................: 1981   32.923546/s
     iteration_duration.............: avg=182.88ms min=366.08µs med=228.41ms max=464.5ms  p(90)=379.36ms p(95)=400.12ms p(99)=417.04ms
     iterations.....................: 1981   32.923546/s
     vus............................: 6      min=3         max=13
     vus_max........................: 150    min=150       max=150


running (1m00.2s), 000/150 VUs, 1981 complete and 0 interrupted iterations
spike ✓ [ 100% ] 000/150 VUs  1m0s  33.00 iters/s